app/views/teams/show.html.slim

- if @team.helpdesk?
  = list_sources(@team) if @team.sources.any?
---
SELECT  1 AS one FROM "sources" WHERE "sources"."team_id" = $1 LIMIT 1  [["team_id", 16]]


- if @team.activities.any?
---
SELECT  "activities".* FROM "activities" WHERE "activities"."team_id" = $1  ORDER BY id DESC LIMIT 1  [["team_id", 16]]
SELECT  1 AS one FROM "activities" WHERE "activities"."team_id" = $1 LIMIT 1  [["team_id", 16]]