app/views/users/show.html.slim

SELECT  1 AS one FROM "conferences" INNER JOIN "attendances" ON "conferences"."id" = "attendances"."conference_id" WHERE "attendances"."user_id" = $1 LIMIT 1  [["user_id", 18]]
---

  - if @user.conferences.any?