app/controllers/orga/seasons_controller.rb

SELECT  "seasons".* FROM "seasons" WHERE "seasons"."name" = $1 LIMIT 1  [["name", "2016"]]
---
  def index
    @seasons = Season.order('name DESC')