app/controllers/activities_controller.rb

    def set_activities
      @activities = Activity.includes(:team).with_kind(whitelisted_kind).ordered.page(params[:page])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."kind" IN ('feed_entry', 'status_update')  ORDER BY published_at DESC, id DESC LIMIT 25 OFFSET 0
SELECT "teams".* FROM "teams" WHERE "teams"."id" IN (24, 23, 22, 21, 20)
SELECT COUNT(*) FROM "activities" WHERE "activities"."kind" IN ('feed_entry', 'status_update')