app/controllers/calendar_controller.rb

SELECT "conferences".* FROM "conferences"
---
  def events
    respond_to do |format|
      format.json { render json: Conference.all }