app/controllers/conferences_controller.rb

  def show
    @conference = Conference.find(params[:id])
---
SELECT  "conferences".* FROM "conferences" WHERE "conferences"."id" = $1 LIMIT 1  [["id", 0]]

  def create
    @conference = Conference.new(conference_params)
    @conference.season_id = current_season.id
    @conference.gid = generate_gid(current_user)

    if @conference.save
---
INSERT INTO "conferences" ("name", "url", "location", "twitter", "tickets", "lightningtalkslots", "starts_on", "ends_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"