app/controllers/omniauth_callbacks_controller.rb

  def github
    user = User.find_or_create_for_github_oauth(request.env['omniauth.auth'])
---
INSERT INTO "users" ("avatar_url", "name", "email", "github_id", "github_handle", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."github_id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["github_id", 18331427]]