app/controllers/projects_controller.rb

  def index
    season = Season.find_by(name: params['filter'])
---
SELECT  "seasons".* FROM "seasons" WHERE "seasons"."name" = $1 LIMIT 1  [["name", "2016"]]