app/controllers/projects_controller.rb

  def show
    @project = Project.find params[:id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 0]]

  def index
    @projects = Project.in_current_season.where(aasm_state: %w(accepted proposed))
---
SELECT "projects".* FROM "projects" WHERE "projects"."season_id" = 1 AND "projects"."aasm_state" IN ('accepted', 'proposed')