app/controllers/teams_controller.rb

  def index
    if params[:sort]
      direction = params[:direction] == 'asc' ? 'ASC' : 'DESC'
      @teams = Team.by_season_phase.includes(:activities).order("teams.kind, activities.created_at #{direction}").references(:activities)
    else
      @teams = Team.by_season_phase.order(:kind, :name)
---
SELECT  "activities".* FROM "activities" WHERE "activities"."team_id" = $1  ORDER BY id DESC LIMIT 1  [["team_id", 16]]
SELECT "teams".* FROM "teams" WHERE (teams.invisible IS NOT TRUE OR teams.kind IN ('sponsored','voluntary')) AND "teams"."season_id" = 1  ORDER BY "teams"."kind" ASC, "teams"."name" ASC