app/controllers/users_controller.rb

SELECT COUNT(DISTINCT "users"."id") AS count_id, users.id AS users_id, conferences.id AS conferences_id, roles.id AS roles_id, teams.id AS teams_id FROM "users" LEFT OUTER JOIN "attendances" ON "attendances"."user_id" = "users"."id" LEFT OUTER JOIN "conferences" ON "conferences"."id" = "attendances"."conference_id" LEFT OUTER JOIN "roles" ON "roles"."user_id" = "users"."id" LEFT OUTER JOIN "teams" ON "teams"."id" = "roles"."team_id" GROUP BY users.id, conferences.id, roles.id, teams.id
---
  def index
    @filters = {
      all:        'All',
      pair:       'Looking for a pair',
      coaching:   'Helping as a Coach',
      mentoring:  'Helping as a Mentor',
      organizing: 'Helping as an Organizer'
    }
    @users = User.ordered(params[:sort],params[:direction])
        .group('users.id').with_all_associations_joined
    @users = @users.with_assigned_roles if Time.now.utc > (current_season.starts_at || Date.new)
    @users = @users.with_role(params[:role]) if params[:role].present? && params[:role] != 'all'
    @users = @users.with_interest(params[:interest]) if params[:interest].present? && params[:interest] != 'all'
    @users = Kaminari.paginate_array(@users.search(params[:search])).page(params[:page])